[
    {
        "title": "🚴‍♀️ Bikewatching",
        "year": "2025",
        "image": "../images/bikewatching.png",
        "description": "In this project, I used D3 to create a map visualiztion. It is an interactive visualization that allows you to filter by time of day, and you can see the bike traffic in stations in Boston and Cambridge.",
        "url": "https://jahnavi-naik.github.io/bikewatching/"
    },
    {
        "title": "Sunny, Cloudy, Wet, or Dry: How Cities Compare on Weather Annually",
        "year": "2025", 
        "image": "../images/weather_visual.png",
        "description": "This is a visual I created in Tableau based on a dataset that included monthly rainfall inches and sunshine hours for 6 cities. The goal of this visual is to discover which cities bask in the sun, soak in the rain, or strike the perfect weather balance.",
        "url": "https://public.tableau.com/app/profile/jahnavi.naik/viz/MapofAverageRainfallinchesEachYearPerCity/Sheet4"
    },
    {
        "title": "Predicting Recipe Ratings",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "This was my final project for my dsc80 class. I was given a raw dataset, taken from food.com, of recipes along with ratings and reviews given by real people. I created a Random Forest Classification mode, and used Grid Search CV to determine the best hyperparameters for the model. After trying many different combinations of variables, I was able to create a model with an F-1 score of 0.91.",
        "url": "https://github.com/jahnavi-naik/recipe-analysis"
    },
    {
        "title": "Hangman Simulator",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "For this project, I wanted to make a function that could beat hangman every time. I started by making a random inference function that would randomly choose the next letter to guess as a benchmark. I then created a function using bayesian inference, that was able to score an 93.8% accuracy after playing 1000 games.",
        "url": ""
    },
    {
        "title": "COVID's Affect on Stress Levels",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "This project focused on the exploratory data analysis step of the data science lifecycle. We wanted to determine the how the shift to remote work because of COVID affected the mental health of femal employees in healthcare, retail, and education in North Anmerica. Thoughout this project, we focused in creating a focused research questions, and heavily exploring our data to reach our conclusions.",
        "url": ""
    },
    {
        "title": "Ngram Model",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "In this project, I used a large dataset of books to train an Ngram model to determine the probability of a word appearing in a sequence given N words. This can be used for natural language processing.",
        "url": ""
    },
    {
        "title": "Lender Decision Making",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "This project focused on seeing the different variables that influenced the decision for banks to give out loans. We explored a dataset that had informaiton about this, and explored the different variables to understand their relationships with the loans and interest rates given.",
        "url": ""
    },
    {
        "title": "Disney Plus Statistics",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "For this project, I wanted to practice creating visualizations in Tableu. To do this, I first found a dataset from Kaggle containing statistics about the Disney Plus streaming service. I then cleaned the data and created different visualizations about the trends. This is my first project in Tableu, so it really allowed me to play with the different features and familiarize myself with all that it can do. It made me really understand the data and what is was telling me in order to create visualizations.",
        "url": "https://public.tableau.com/app/profile/jahnavi.naik/viz/DisneyPlusDashboard_16914335376510/Dashboard1"
    },
    {
        "title": "Will Driver Accept the Coupon?",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "I completed this project with a group in my CS105 class. We found the dataset through the UCI repository, cleaned the data, created visualizations to display different aspects of the data, and ran a K Nearest Neighbors Analysis, yeilding a model with 66% accuracy. All work was done using Python though Jupyter Notebook. Thorugh this project, I got real experience collaborating with my group members and splitting up the work in an effecient way. I learned the importance of constant communication to successfully complete the project",
        "url": "https://github.com/jahnavi-naik/DriverCouponProject"
    },
    {
        "title": "Titanic Survival",
        "year": "2021",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "This Kaggle competition was about creating a model that would determine if the passenger survived or not, using the given data. I used the given training set to train my Decision Trees model, selecting my features using the select best k algorithm, and then used that model on the test set, obtaining an accuracy score of 78%. I did this work using Python using a Jupyter notebook, and later uploaded it to Kaggle. This project allowed my to expand my knowledge on various maching learning models, as I had never used the decidion trees model previously. It gave me lots of practice on cleaning and transforming the data on order for it to be used for the model, and gave me practice in python in general.",
        "url": "https://github.com/jahnavi-naik/TitanicKaggleProject"
    },
    {
        "title": "Veniam sunt praesentium iusto?",
        "year": "2021",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Reiciendis repellendus, necessitatibus magni, rerum provident perspiciatis dolores temporibus enim, laboriosam excepturi quia odit? Neque officiis maiores dolorum officia tenetur provident, voluptas velit similique quidem ad quasi totam, distinctio facilis!",
        "url": ""
    },
    {
        "title": "Optio amet delectus aut.",
        "year": "2021",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Optio eos natus sed provident consequuntur maiores molestiae officia ea atque totam. Ipsa, inventore placeat mollitia veritatis quasi ratione nostrum nihil ipsam, nesciunt amet dolorum neque dolor enim eius! Similique!",
        "url": ""
    },
    {
        "title": "Officiis reiciendis natus amet?",
        "year": "2020",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Itaque similique a sit ipsa. Pariatur atque doloribus delectus quae temporibus, illum sint animi cum culpa eligendi? Autem, dolore. Aperiam consequuntur alias minima atque animi nesciunt perferendis! Eligendi, ullam quas?",
        "url": ""
    }
]